import os
from config import Config

class  Script(object):
  START_TXT = """<b>היי {} 👋
  
אני בוט מתקדם להעברת הודעות.
אני יכול להעביר הודעות מערוץ אחד לערוץ אחר.</b>

**לחץ על הכפתור עזרה כדי לקבל פרטים נוספים עליי🔥**"""
  HELP_TXT = """<b><u>🔆 עזרה</b></u>

<b><u>📚 פקודות זמינות:</u></b>
<b>⏣ </b>/start<b><i> - </i>בדוק שאני בחיים</b><b><i>
⏣ </i></b>/forward<b><i> - </i>העבר הודעות</b><b><i>
⏣ </i></b>/unequify<b><i> - </i>מחק הודעות כפולות בערוצים</b><b><i>
⏣ </i></b>/settings<b><i> - </i>הגדר את ההגדרות שלך</b><b><i>
⏣ </i></b>/reset<b><i> - </i>אפס את ההגדרות שלך</b><i>


</i><blockquote expandable><i><b><u>💢 תכונות:</u></b>
• העבר הודעה מערוץ ציבורי לערוץ שלך ללא אישור מנהל. אם הערוץ פרטי צריך הרשאת מנהל
• העבר הודעה מערוץ פרטי לערוץ שלך באמצעות userbot (המשתמש חייב להיות חבר שם)
• כיתוב מותאם אישית
• כפתור מותאם אישית
• תמיכה בצ'אטים מוגבלים
• דלג על הודעות כפולות
• סוג מסנן של הודעות
• דלג על הודעות המבוססות על הרחבות ומילות מפתח וגודל</i></blockquote>
"""
  
  HOW_USE_TXT = """<b><i><u>⚠️ לפני העברה:</u></i></b>
  
<blockquote><i>• הוסף בוט או משתמשבוט
• הוסף לפחות אחד לערוץ (הבוט/יוזרבוט שלך חייב להיות מנהל שם)
• אתה יכול להוסיף צ'אטים או בוטים באמצעות </i><i>/settings</i><i>
• אם ערוץ מקור פרטי היוזרבוט שלך חייב להיות חבר שם. או שהבוט שלך חייב להזדקק להרשאת מנהל גם שם
• לאחר מכן השתמש </i><i>/forward</i><i> כדי להעביר הודעות</i>
</blockquote>"""
  
  ABOUT_TXT = """<blockquote><b>╔════❰ ғᴏʀᴡᴀʀᴅ ʙᴏᴛ ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼📃ʙᴏᴛ : </b><a href="https://t.me/My_Forward_Messages_RoBot"><b>Fᴏʀᴡᴀᴅ Bᴏᴛ</b></a><b>
║┣⪼👦Cʀᴇᴀᴛᴏʀ : </b><a href="https://t.me/The_Joker121"><b>𝑻𝒉𝒆 𝑱𝒐𝒌𝒆𝒓🃏</b></a><b>
║┣⪼🤖Uᴘᴅᴀᴛᴇ : </b><a href="https://t.me/bot_sratim_sdarot"><b>בוטים 🇮🇱</b></a><b>
║┣⪼📡Hᴏsᴛᴇᴅ ᴏɴ : Sᴜᴘᴇʀ Fᴀsᴛ
║┣⪼🗣️Lᴀɴɢᴜᴀɢᴇ : Pʏᴛʜᴏɴ3
║┣⪼📚Lɪʙʀᴀʀʏ : Pʏʀᴏɢʀᴀᴍ Gᴀᴛʜᴇʀ 2.11.0 
║┣⪼🗒️Vᴇʀsɪᴏɴ : 0.18.3
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪</b></blockquote>
"""
  STATUS_TXT = """<blockquote>╔════❰ ʙᴏᴛ sᴛᴀᴛᴜs  ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼**⏳ ʙᴏᴛ ᴜᴘᴛɪᴍᴇ:**`{}`
║┃
║┣⪼**👱 Tᴏᴛᴀʟ Usᴇʀs:** `{}`
║┃
║┣⪼**🤖 Tᴏᴛᴀʟ Bᴏᴛ:** `{}`
║┃
║┣⪼**🔃 Fᴏʀᴡᴀʀᴅɪɴɢs:** `{}`
║┃
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪</blockquote>
"""
  FROM_MSG = "<blockquote><b>❪ הגדר צ'אט מקור ❫\n\nהעבר את ההודעה האחרונה או קישור ההודעה האחרונה של צ'אט מקור.\n/cancel - כדי לבטל תהליך שלח</b></blockquote>"
  TO_MSG = "<blockquote><b>❪ בחר צ'אט יעד ❫\n\nבחר את צ'אט היעד שלך מתוך הכפתורים הנתונים.\n/cancel - ביטול תהליך זה</b></blockquote>"
  SKIP_MSG = "<blockquote>❪ הגדר מספר דילוג על הודעה ❫\n\nדלג על ההודעה ככל שתזין את המספר ושאר ההודעה תועבר.\nמספר דילוג כברירת מחדל = 0.\n\nלדוגמא: את בוחר 0 הבוט מדלג על 0 הודעות ראשונות ואז מתחיל להעביר משם.\nאתה בוחר 5 הבוט מדלג על 5 הודעות ראשונות ואז מתחיל להעביר משם...\nלביטול התהליך שלח את הפקודה - /cancel</blockquote>"
  CANCEL = "<blockquote><b>התהליך בוטל בהצלחה!</b></blockquote>"
  BOT_DETAILS = "<blockquote><b><u>📄 פרטי בוט</b></u>\n\n<b>➣ שם:</b> <code>{}</code>\n<b>➣ מזהה בוט:</b> <code>{}</code>\n<b>➣ שם משתמש:</b> @{}</blockquote>"
  USER_DETAILS = "<blockquote><b><u>📄 פרטי משתמש בוט</b></u>\n\n<b>➣ שם:</b> <code>{}</code>\n<b>➣ מזהה משתמש:</b> <code>{}</code>\n<b>➣ שם משתמש:</b> @{}</blockquote>"  
         
  TEXT = """<blockquote>╔════❰ ғᴏʀᴡᴀʀᴅ sᴛᴀᴛᴜs  ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼<b>🕵 ғᴇᴄʜᴇᴅ Msɢ :</b> <code>{}</code>
║┃
║┣⪼<b>✅ sᴜᴄᴄᴇғᴜʟʟʏ Fᴡᴅ :</b> <code>{}</code>
║┃
║┣⪼<b>👥 ᴅᴜᴘʟɪᴄᴀᴛᴇ Msɢ :</b> <code>{}</code>
║┃
║┣⪼<b>🗑 ᴅᴇʟᴇᴛᴇᴅ Msɢ :</b> <code>{}</code>
║┃
║┣⪼<b>🪆 Sᴋɪᴘᴘᴇᴅ Msɢ :</b> <code>{}</code>
║┃
║┣⪼<b>🔁 Fɪʟᴛᴇʀᴇᴅ Msɢ :</b> <code>{}</code>
║┃
║┣⪼<b>📊 Cᴜʀʀᴇɴᴛ Sᴛᴀᴛᴜs:</b> <code>{}</code>
║┃
║┣⪼<b>𖨠 Pᴇʀᴄᴇɴᴛᴀɢᴇ:</b> <code>{}</code> %
║╰━━━━━━━━━━━━━━━➣ 
╚════❰ {} ❱══❍⊱❁۪۪</blockquote>"""
  DUPLICATE_TEXT = """<blockquote>╔════❰ ᴜɴᴇǫᴜɪғʏ sᴛᴀᴛᴜs ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼ <b>ғᴇᴛᴄʜᴇᴅ ғɪʟᴇs:</b> <code>{}</code>
║┃
║┣⪼ <b>ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴅᴇʟᴇᴛᴇᴅ:</b> <code>{}</code> 
║╰━━━━━━━━━━━━━━━➣
╚════❰ {} ❱══❍⊱❁۪۪</blockquote>
"""
  DOUBLE_CHECK = """<blockquote><b><u>בדיקה כפולה ⚠️</b></u>
<code>לפני העברת ההודעות לחץ על כפתור 'כן' רק לאחר בדיקה של הדברים הבאים</code>

<b>★ הבוט שלך:</b> [{botname}](t.me/{botuname})
<b>★ מהערוץ:</b> `{from_chat}`
<b>★ לערוץ:</b> `{to_chat}`
<b>★ דלג על הודעות:</b> `{skip}`

<i>° [{botname}](t.me/{botuname}) חייב להיות מנהל ב**צ'אט יעד**</i> (`{to_chat}`)
<i>° אם ה-**צ'אט מקור** הוא פרטי, ה-userbot שלך חייב להיות חבר שם או שהבוט שלך חייב להיות מנהל גם שם</b></i>

<b>אם הדברים הנ"ל נבדקו, אז ניתן ללחוץ על כפתור 'כן'</b></blockquote>"""
  
  SETTINGS_TXT = """<blockquote><b>שנה את ההגדרות שלך כפי שתרצה</b></blockquote>"""
